#--------------------------------------------------
# Read Library
#--------------------------------------------------

#--------------------------------------------------
# Read Library
#--------------------------------------------------

read_libs /home/sdl18/cad/FOUNDRY/digital/45nm/NangateOpenCellLibrary_v1.00_20080225/liberty/FreePDK45_lib_v1.0_typical.lib

#--------------------------------------------------
# Read RTL
#--------------------------------------------------

read_hdl ../rtl/alu.v

elaborate alu
#--------------------------------------------------
# Read Constraints
#--------------------------------------------------

read_sdc ../constraints/alu.sdc

#--------------------------------------------------
# Synthesis
#--------------------------------------------------

syn_generic

syn_map

syn_opt

gui_show

#--------------------------------------------------
# Reports
#--------------------------------------------------

report_area > ../reports/area.rpt

report_timing > ../reports/timing.rpt

report_power > ../reports/power.rpt

#--------------------------------------------------
# Netlist
#--------------------------------------------------

write_hdl > ../reports/alu_8bit_synth.v
